---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleAngle
source: html/d5aa7fbc-26a2-110e-ab23-c4da27bc869e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleAngle Property

"Chamfer angle"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemHoleAngle { get; }
```